# OCSF Gold Mapping Template: account_change
# Class UID: 3001 | Category: Identity & Access Management
#
# Account change events capture modifications to user accounts.

gold:
  # Note: clusterBy is supported in dsl_spark.py mode but not in SDP mode (sinks don't support it atm)
  # For SDP mode, run ALTER TABLE after pipeline creation:
  #   ALTER TABLE <catalog>.<database>.account_change CLUSTER BY (time, user.name)
  - name: account_change
    input: <YOUR_SILVER_TABLE_NAME>
    # clusterBy: ["time", "user.name"]  # Only works in dsl_spark.py mode
    fields:
      - name: activity_id
        expr: # 1=Create, 2=Enable, 3=Password Change, 4=Disable, 5=Delete, 6=Attach Policy, 7=Detach Policy
      - name: activity_name
        expr: 
      - name: category_uid
        literal: 3
      - name: category_name
        literal: Identity & Access Management
      - name: class_uid
        literal: 3001
      - name: class_name
        literal: Account Change
      - name: severity_id
        expr: 
      - name: time
        from: 
      - name: type_uid
        expr: 
      - name: type_name
        expr: 
      - name: user.name
        expr: 
      - name: user.uid
        expr: 
      - name: user.type_id
        expr: 
      - name: user_result.name
        expr: # Resulting user state after change
      - name: user_result.uid
        expr: 
      - name: actor.user.name
        expr: # Who made the change
      - name: actor.user.uid
        expr: 
      - name: status_id
        expr: 
      - name: metadata.product.name
        literal: 
      - name: metadata.product.vendor_name
        literal: 
      - name: metadata.logged_time
        from: 
      - name: metadata.processed_time
        expr: current_timestamp()
      - name: metadata.uid
        expr: 
      - name: raw_data
        from: 

