# OCSF Gold Mapping Template: account_change
# Class UID: 3001 | Category: Identity & Access Management
#
# Account change events capture modifications to user accounts.

gold:
  # Note: clusterBy is supported in SSS (Spark Structured Streaming) mode but not in SDP mode (sinks don't support it atm)
  # For SDP mode, run ALTER TABLE after pipeline creation:
  #   ALTER TABLE <catalog>.<database>.account_change CLUSTER BY (time, user.name)
  - name: account_change
    input: <YOUR_SILVER_TABLE_NAME>
    # clusterBy: ["time", "user.name"]  # Only works in SSS mode (src/sss_gold.py)
    fields:
      - name: activity_id
        expr: # 1=Create, 2=Enable, 3=Password Change, 4=Disable, 5=Delete, 6=Attach Policy, 7=Detach Policy
      - name: activity_name
        expr: 
      # Category & Class
      - name: category_name
        literal: Identity & Access Management
      - name: category_uid
        expr: CAST(3 AS INT)
      - name: class_name
        literal: Account Change
      - name: class_uid
        expr: CAST(3001 AS INT)
      
      - name: severity_id
        expr: 
      - name: time
        from: 
      - name: type_uid
        expr: 
      - name: type_name
        expr: 
      - name: user.name
        expr: 
      - name: user.uid
        expr: 
      - name: user.type_id
        expr: 
      - name: user_result.name
        expr: # Resulting user state after change
      - name: user_result.uid
        expr: 
      - name: actor.user.name
        expr: # Who made the change
      - name: actor.user.uid
        expr: 
      - name: status_id
        expr: 
      - name: action
        expr: # TODO: Map to your source field

      - name: action_id
        expr: # TODO: Map to your source field

      - name: activity
        expr: # TODO: Map to your source field

      - name: api
        expr: # TODO: Map to your source field

      - name: cloud
        expr: # TODO: Map to your source field

      - name: disposition
        expr: # TODO: Map to your source field

      - name: disposition_id
        expr: # TODO: Map to your source field

      - name: enrichments
        expr: # TODO: Map to your source field (VARIANT/ARRAY)

      - name: message
        expr: # TODO: Map to your source field

      - name: observables
        expr: # TODO: Map to your source field (VARIANT/ARRAY)

      - name: policies
        expr: # TODO: Map to your source field

      - name: severity
        expr: # TODO: Map to your source field

      - name: src_endpoint
        expr: # TODO: Map to your source field

      - name: status
        expr: # TODO: Map to your source field

      - name: status_code
        expr: # TODO: Map to your source field

      - name: status_detail
        expr: # TODO: Map to your source field

      - name: timezone_offset
        expr: # TODO: Map to your source field (timezone offset in minutes)

      - name: unmapped
        expr: # TODO: Map to your source field (VARIANT/ARRAY)
      # Metadata (OCSF Standard Fields)
      - name: metadata.version
        literal: "1.7.0"  # OCSF schema version
      - name: metadata.product.name
        literal: # Product name (e.g., "Zeek Conn", "Cisco IOS")
      - name: metadata.product.vendor_name
        literal: # Vendor name (e.g., "Zeek", "Cisco")
      - name: metadata.log_provider
        literal: # Log provider/source (e.g., "zeek", "cisco", "cloudflare")
      - name: metadata.log_name
        literal: # Log name/sourcetype (e.g., "conn", "ios", "gateway_dns")
      - name: metadata.log_format
        literal: # Log format (e.g., "JSON", "syslog", "CSV")
      - name: metadata.log_version
        literal: # Schema version format: "source@sourcetype:version@1.0" (e.g., "zeek@conn:version@1.0")
      - name: metadata.processed_time
        expr: CURRENT_TIMESTAMP()  # When processed by pipeline
      - name: metadata.logged_time
        from: time  # When the event was logged (REQUIRED: map to your time field)
      # Raw data
      - name: raw_data
        from: 

