# OCSF Gold Mapping Template: group_management
# Class UID: 3006 | Category: Identity & Access Management
#
# Group Management events capture group membership changes.

gold:
  # Note: clusterBy is supported in dsl_spark.py mode but not in SDP mode (sinks don't support it atm)
  # For SDP mode, run ALTER TABLE after pipeline creation:
  #   ALTER TABLE <catalog>.<database>.group_management CLUSTER BY (time, group.name)
  - name: group_management
    input: <YOUR_SILVER_TABLE_NAME>
    # clusterBy: ["time", "group.name"]  # Only works in dsl_spark.py mode
    fields:
      - name: activity_id
        expr: # 1=Add User, 2=Remove User, 3=Create Group, 4=Delete Group, 5=Update Group
      - name: activity_name
        expr: 
      - name: category_uid
        literal: 3
      - name: category_name
        literal: Identity & Access Management
      - name: class_uid
        literal: 3006
      - name: class_name
        literal: Group Management
      - name: severity_id
        expr: 
      - name: time
        from: 
      - name: type_uid
        expr: 
      - name: type_name
        expr: 
      - name: group.name
        expr: # Group name
      - name: group.uid
        expr: # Group ID
      - name: group.type
        expr: # Security, Distribution, etc.
      - name: user.name
        expr: # User being added/removed
      - name: user.uid
        expr: 
      - name: actor.user.name
        expr: # Who made the change
      - name: actor.user.uid
        expr: 
      - name: resource.name
        expr: # Resource if applicable
      - name: resource.uid
        expr: 
      - name: status_id
        expr: 
      - name: metadata.product.name
        literal: 
      - name: metadata.product.vendor_name
        literal: 
      - name: metadata.logged_time
        from: 
      - name: metadata.processed_time
        expr: current_timestamp()
      - name: metadata.uid
        expr: 
      - name: raw_data
        from: 

