# OCSF Gold Mapping Template: datastore_activity
# Class UID: 4007 | Category: Network Activity
#
# Datastore Activity events capture database and data store operations.

gold:
  # Note: clusterBy is supported in SSS (Spark Structured Streaming) mode but not in SDP mode (sinks don't support it atm)
  # For SDP mode, run ALTER TABLE after pipeline creation:
  #   ALTER TABLE <catalog>.<database>.datastore_activity CLUSTER BY (time, dst_endpoint.ip)
  - name: datastore_activity
    input: <YOUR_SILVER_TABLE_NAME>
    # clusterBy: ["time", "dst_endpoint.ip"]  # Only works in SSS mode (src/sss_gold.py)
    fields:
      - name: activity_id
        expr: # 1=Create, 2=Read, 3=Update, 4=Delete, 5=Query, 6=Allocate, 7=Deallocate
      - name: activity_name
        expr: 
      # Category & Class
      - name: category_name
        literal: Application Activity
      - name: category_uid
        expr: CAST(6 AS INT)
      - name: class_name
        literal: Datastore Activity
      - name: class_uid
        expr: CAST(6005 AS INT)
      
      - name: severity_id
        expr: 
      - name: time
        from: 
      - name: type_uid
        expr: 
      - name: type_name
        expr: 
      - name: database.name
        expr: # Database name
      - name: database.uid
        expr: 
      - name: database.type
        expr: # mysql, postgres, mongodb, etc.
      - name: databucket.name
        expr: # Bucket/container name
      - name: databucket.uid
        expr: 
      - name: table.name
        expr: # Table name
      - name: table.uid
        expr: 
      - name: api.operation
        expr: # Operation performed (SELECT, INSERT, etc.)
      - name: http_request.url
        expr: # If via HTTP/REST
      - name: http_request.http_method
        expr: 
      - name: http_response.code
        expr: 
      - name: actor.user.name
        expr: 
      - name: actor.user.uid
        expr: 
      - name: src_endpoint.ip
        expr: # Client IP
      - name: dst_endpoint.ip
        expr: # Database server IP
      - name: dst_endpoint.port
        expr: # Database port
      - name: status_id
        expr: 
      - name: action
        expr: # TODO: Map to your source field

      - name: action_id
        expr: # TODO: Map to your source field

      - name: cloud
        expr: # TODO: Map to your source field

      - name: device
        expr: # TODO: Map to your source field

      - name: disposition
        expr: # TODO: Map to your source field

      - name: disposition_id
        expr: # TODO: Map to your source field

      - name: enrichments
        expr: # TODO: Map to your source field (VARIANT/ARRAY)

      - name: message
        expr: # TODO: Map to your source field

      - name: observables
        expr: # TODO: Map to your source field (VARIANT/ARRAY)

      - name: severity
        expr: # TODO: Map to your source field

      - name: status
        expr: # TODO: Map to your source field

      - name: status_code
        expr: # TODO: Map to your source field

      - name: status_detail
        expr: # TODO: Map to your source field

      - name: timezone_offset
        expr: # TODO: Map to your source field (timezone offset in minutes)

      - name: type
        expr: # TODO: Map to your source field

      - name: type_id
        expr: # TODO: Map to your source field

      - name: unmapped
        expr: # TODO: Map to your source field (VARIANT/ARRAY)
      # Metadata (OCSF Standard Fields)
      - name: metadata.version
        literal: "1.7.0"  # OCSF schema version
      - name: metadata.product.name
        literal: # Product name (e.g., "Zeek Conn", "Cisco IOS")
      - name: metadata.product.vendor_name
        literal: # Vendor name (e.g., "Zeek", "Cisco")
      - name: metadata.log_provider
        literal: # Log provider/source (e.g., "zeek", "cisco", "cloudflare")
      - name: metadata.log_name
        literal: # Log name/sourcetype (e.g., "conn", "ios", "gateway_dns")
      - name: metadata.log_format
        literal: # Log format (e.g., "JSON", "syslog", "CSV")
      - name: metadata.log_version
        literal: # Schema version format: "source@sourcetype:version@1.0" (e.g., "zeek@conn:version@1.0")
      - name: metadata.processed_time
        expr: CURRENT_TIMESTAMP()  # When processed by pipeline
      - name: metadata.logged_time
        from: time  # When the event was logged (REQUIRED: map to your time field)
      # Raw data
      - name: raw_data
        from: 

