# OCSF Gold Mapping Template: scheduled_job_activity
# Class UID: 1006 | Category: System Activity
#
# Scheduled Job Activity events capture scheduled task/cron job events.

gold:
  - name: scheduled_job_activity
    input: <YOUR_SILVER_TABLE_NAME>
    fields:
      - name: activity_id
        expr: # 1=Create, 2=Update, 3=Delete, 4=Start, 5=Stop, 6=Complete
      - name: activity_name
        expr: 
      - name: category_uid
        literal: 1
      - name: category_name
        literal: System Activity
      - name: class_uid
        literal: 1006
      - name: class_name
        literal: Scheduled Job Activity
      - name: severity_id
        expr: 
      - name: time
        from: 
      - name: type_uid
        expr: 
      - name: type_name
        expr: 
      - name: job.name
        expr: # Job/task name
      - name: job.cmd_line
        expr: # Command to execute
      - name: job.file.path
        expr: # Script/executable path
      - name: job.file.name
        expr: # Script/executable name
      - name: job.run_state_id
        expr: # 1=Queued, 2=Running, 3=Completed, 4=Failed
      - name: job.run_state
        expr: 
      - name: job.created_time
        expr: 
      - name: job.last_run_time
        expr: 
      - name: job.next_run_time
        expr: 
      - name: job.user.name
        expr: # User context for job
      - name: job.user.uid
        expr: 
      - name: actor.user.name
        expr: # Who created/modified the job
      - name: actor.user.uid
        expr: 
      - name: device.hostname
        expr: 
      - name: device.ip
        expr: 
      - name: start_time
        expr: 
      - name: status_id
        expr: 
      - name: metadata.product.name
        literal: 
      - name: metadata.product.vendor_name
        literal: 
      - name: metadata.logged_time
        from: 
      - name: metadata.processed_time
        expr: current_timestamp()
      - name: metadata.uid
        expr: 
      - name: raw_data
        from: 

